holgerlembke/ESPxWebFlMgr/src/ESP8266WebFlMgr.cpp
#include <Arduino.h>
#include <inttypes.h>
#include <ESP8266WebFlMgr.h>
#include <ESP8266WebServer.h>
#include <WiFiUdp.h>
#include <FS.h>

// getting access to the nice mime-type-table and getContentType()
#include "detail/RequestHandlersImpl.h"

//*****************************************************************************************************
ESP8266WebFlMgr::ESP8266WebFlMgr(word port) {
  _Port = port;
}

//*****************************************************************************************************
ESP8266WebFlMgr::~ESP8266WebFlMgr() {
  end();
}

//*****************************************************************************************************
void ESP8266WebFlMgr::begin() {
  fileManager = new ESP8266WebServer(_Port);

#ifdef fileManagerServerStaticsInternally
  fileManager->on("/", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerIndexpage, this));
  fileManager->on("/fm.css", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerCSS, this));
  fileManager->on("/fm.js", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerJS, this));
#endif

  fileManager->on("/i", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerFileListInsert, this));
  fileManager->on("/c", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerCommandExecutor, this));
  fileManager->on("/e", HTTP_GET, std::bind(&ESP8266WebFlMgr::fileManagerFileEditorInsert, this));
  // file receiver with attached file to form
  fileManager->on("/r", HTTP_POST, std::bind(&ESP8266WebFlMgr::fileManagerReceiverOK, this),
                                   std::bind(&ESP8266WebFlMgr::fileManagerReceiver, this));

  fileManager->onNotFound(std::bind(&ESP8266WebFlMgr::fileManagerNotFound, this));

  fileManager->begin();
}

//*****************************************************************************************************
void ESP8266WebFlMgr::end() {
  if (fileManager) {
    delete fileManager; 	
    fileManager=NULL;
  }
}

//*****************************************************************************************************
void ESP8266WebFlMgr::handleClient() {
  if (fileManager) {
    fileManager->handleClient();
  }
}

//*****************************************************************************************************
void ESP8266WebFlMgr::setViewSysFiles(bool vsf) {
  _ViewSysFiles = vsf;
}

//*****************************************************************************************************
bool ESP8266WebFlMgr::getViewSysFiles(void) {
  return _ViewSysFiles;
}

//*****************************************************************************************************
void ESP8266WebFlMgr::setSysFileStartPattern(String sfsp) {
  _SysFileStartPattern = sfsp;
}

//*****************************************************************************************************
String ESP8266WebFlMgr::getSysFileStartPattern(void) {
  return _SysFileStartPattern;
}


//*****************************************************************************************************
// privates start here
//*****************************************************************************************************
//*****************************************************************************************************
//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerNotFound(void) {
  String uri = fileManager->uri();

  if (uri == "/") {
    uri = "/fm.html";
  }

  String contentTyp = StaticRequestHandler::getContentType(uri);

#ifndef fileManagerServerStaticsInternally
  if (SPIFFS.exists(uri)) {
    File f = SPIFFS.open(uri, "r");
    if (f) {
      if (fileManager->streamFile(f, contentTyp) != f.size()) {
        // Serial.println(F("Sent less data than expected!"));
        // We should panic a little bit.
      }
      f.close();
    }
  } else
#endif
  {
    fileManager->send(404, F("text/plain"), F("URI not found."));
  }
}

//*****************************************************************************************************
String ESP8266WebFlMgr::dispIntDotted(size_t i) {
  String res = "";
  while (i != 0) {
    int r = i % 1000;
    res = String(i % 1000) + res;
    i /= 1000;
    if ( (r < 100) && (i > 0) ) {
      res = "0" + res;
      if (r < 10) {
        res = "0" + res;
      }
    }
    if (i != 0) {
      res = "." + res;
    }
  }
  return res;
}

//*****************************************************************************************************
String ESP8266WebFlMgr::dispFileString(size_t fs) {
  if (fs < 0) {
    return "-0";
  }

  if (fs == 0) {
    return "0 B";
  }

  if (fs < 1000) {
    return String(fs) + " B";
  }

  String units[] = { "B", "kB", "MB", "GB", "TB" };
  int digitGroups = (int) (log10(fs) / log10(1024));
  return String(fs / pow(1024, digitGroups)) + " " + units[digitGroups] + " <small>(" + dispIntDotted(fs) + " B)</small>";
}

//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerIndexpage(void) {
  fileManager->setContentLength(CONTENT_LENGTH_UNKNOWN);
  fileManager->send(200, F("text/html"), String());

  //++++++++++++++++++++++
  static const char s1[] PROGMEM = R"==x==(
<!DOCTYPE html>
<html lang="en">
  <head>
    <link rel="stylesheet" type="text/css" href="/fm.css">
    <script src="/fm.js"></script>  
    <script src="/gzipper.js"></script>  
    <title>FileManager</title>
  </head>
  <body>
    <div id="gc">
        <div class="o1">&nbsp;</div>
        <div class="o2">&nbsp;</div>
        <div class="o3"><nobr id="oo3">&nbsp;</nobr></div>
        <div class="o4">&nbsp;</div>

        <div class="m1">
            <div class="s11">&nbsp;</div>
            <div class="s12">
              <div class="s13">&nbsp;</div>
            </div>
        </div>
        <div class="m2" ondrop="dropHandler(event);" ondragover="dragOverHandler(event);">
          File<br />
          Drop<br />
          Zone<br />
        </div>
        <div class="m3">
            <div class="s31">&nbsp;</div>
            <div class="s32">
              <div class="s33">&nbsp;</div>
            </div>
        </div>

