holgerlembke/ESPxWebFlMgr/src/ESP8266WebFlMgr.cpp
  fileManager->sendContent(F("##"));
  fileManager->sendContent(sinfo);

  fileManager->sendContent("");
  delay(1);
}

// in place editor
//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerFileEditorInsert(void) {
  // Serial.println("Edit");

  if ( (fileManager->args() == 1) && (fileManager->argName(0) == "edit") ) {
	  
    String fn = fileManager->arg(0);
    if ( (! _ViewSysFiles) && (!allowAccessToThisFile(fn)) ) {
      fileManager->send(404, F("text/plain"), F("Illegal."));
	  return;
    }
 
    fileManager->setContentLength(CONTENT_LENGTH_UNKNOWN);
    fileManager->send(200, F("text/html"), String());

    fileManager->sendContent(F("<form method=\"post\" action=\"ed?fn="));
	fileManager->sendContent(fn);
	fileManager->sendContent(F("\"><textarea id=\"tect\" rows=\"25\" cols=\"80\">"));

    /*
    if (SPIFFS.exists(fn)) {
      Serial.println("FN send");
      File f = SPIFFS.open(fn, "r");
      if (f) {
        fileManager->client().write(f);
        f.close();
      }
	}
	*/
    if (SPIFFS.exists(fn)) {
      File f = SPIFFS.open(fn, "r");
      if (f) {
        do {
          String l = f.readStringUntil('\n')+'\n'; 
          fileManager->sendContent(l);
		} while (f.available());
        f.close();
      }
	}

    fileManager->sendContent(F("</textarea></form><button title=\"Save file\" onclick='sved(\""));
	fileManager->sendContent(fn);
	fileManager->sendContent(F("\");' >Save</button>"));
    fileManager->sendContent(F("&nbsp;<button title=\"Abort editing\" onclick=\"abed();\" >Abort editing</button>"));
    //fileManager->sendContent(F("</form>"));
	
    fileManager->sendContent(F("<script id=\"info\">document.getElementById('oo3').innerHTML = \""));
    fileManager->sendContent("File: ");
    fileManager->sendContent(F("\";</script>"));

    fileManager->sendContent("");
  } else {
    fileManager->send(404, F("text/plain"), F("Illegal."));
  }

  delay(1);
}

// Drag and Drop
//   https://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API/File_drag_and_drop
//   https://www.ab-heute-programmieren.de/drag-and-drop-upload-mit-html5/#Schritt_3_Eine_Datei_hochladen
//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerReceiverOK(void) {
  // Serial.println("fileManagerReceiverOK");	
  fileManager->send(200);
  delay(1);
}

//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerReceiver(void) {
  //Serial.println("fileManagerReceiver");	

  HTTPUpload& upload = fileManager->upload();
  // Serial.println("Server upload Status: " + String(upload.status));

  if (upload.status == UPLOAD_FILE_START) {
    String filename = upload.filename;
    if (!filename.startsWith("/")) {
      filename = "/" + filename;
    }
    // Serial.print("handleFileUpload Name: ");
    // Serial.println(filename);

    if (! ( (_ViewSysFiles) || (allowAccessToThisFile(filename)) ) ) {
      filename = "/illegalfilename";
    }

    // cut length
    filename = CheckFileNameLengthLimit(filename);

    fsUploadFile = SPIFFS.open(filename, "w");
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    // Serial.print("handleFileUpload Data: ");
    // Serial.println(upload.currentSize);
    if (fsUploadFile)
      fsUploadFile.write(upload.buf, upload.currentSize);
  } else if (upload.status == UPLOAD_FILE_END) {
    if (fsUploadFile) {
      fsUploadFile.close();
      // fsUploadFile = NULL;
    }
    // Serial.print("handleFileUpload Size: ");
    // Serial.println(upload.totalSize);
  }
  delay(1);
}

//*****************************************************************************************************
void ESP8266WebFlMgr::fileManagerCommandExecutor(void) {
	// https://www.youtube.com/watch?v=KSxTxynXiBs
  /** /
    for (uint8_t i = 0; i < fileManager->args(); i++) {
    Serial.print(i);
    Serial.print(" ");
    Serial.print(fileManager->argName(i));
    Serial.print(": ");
    Serial.print(fileManager->arg(i));
    Serial.println();
    }
    /**/

  // no Args: DIE!
  if (fileManager->args() == 0) {
    return;
  }

  // +--++--++--++--++--++--++--++--++--++--++--++--++--++--++--+
  // one arg, "dwn", download
  // must happen in the context of the webpage... thus via "window.location.href="/c?dwn="+filename;"
  if ( (fileManager->args() == 1) && (fileManager->argName(0) == "dwn") ) {
    String fn = fileManager->arg(0);
    if ( (_ViewSysFiles) || (allowAccessToThisFile(fn)) ) {
      File f = SPIFFS.open(fn, "r");
      if (f) {
        fileManager->sendHeader(F("Content-Type"), F("text/text"));
        fileManager->sendHeader(F("Connection"), F("close"));
        fileManager->sendHeader(F("Content-Disposition"), "attachment; filename=" + fn.substring(1));
        fileManager->sendHeader(F("Content-Transfer-Encoding"), F("binary"));
        if (fileManager->streamFile(f, "application/octet-stream") != f.size()) {
          Serial.println(F("Sent less data than expected!"));
        }
        f.close();
        return;
      }
    }
  }

  // +--++--++--++--++--++--++--++--++--++--++--++--++--++--++--+
  // one arg, "del", delete
  if ( (fileManager->args() == 1) && (fileManager->argName(0) == "del") ) {
    String fn = fileManager->arg(0);
    if ( (_ViewSysFiles) || (allowAccessToThisFile(fn)) ) {
      SPIFFS.remove(fn);
    }
  }

  // +--++--++--++--++--++--++--++--++--++--++--++--++--++--++--+
  // one arg, "ren", rename
  if ( (fileManager->args() == 2) && (fileManager->argName(0) == "ren") ) {
    String fn = fileManager->arg(0);
    if ( (_ViewSysFiles) || (allowAccessToThisFile(fn)) ) {
      String fn2 = CheckFileNameLengthLimit(fileManager->arg(1));
      if ( (_ViewSysFiles) || (allowAccessToThisFile(fn2)) ) {
        SPIFFS.rename(fn, fn2);
      }
    }
  }

  // dummy answer
  fileManager->send(200, "text/plain", "");
  delay(1);
}

